[{
  "designation": "Host",
  "img": "https://res.cloudinary.com/kaydence-co/image/upload/v1504706062/Pastor-ben_t9tl07.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Lagos, Nigeria",
  "name": "Pastor Ben Akabueze",
  "profile": "<div class=\"uncode_text_column\"><p>Ben Akabueze hailed from Dunukofia Local Government Area in Anambra State. He is the Pastor-in-charge of RCCG Lagos Province 39 and Pastor of the King’s Court Parish, Victoria Island, Lagos.</p> <p>A distinguished banker, accountant, economist and administrator,&nbsp;he holds a first class B.Sc degree in Accounting from the University of Lagos and an Advanced Management Programme Certificate from the Lagos Business School. A fellow of the Institute of Chartered Accountants of Nigeria (FCA) and a Fellow of the Institute of Credit Administrators (FICA), he has over 25 years experience in Accounting, Consultng and Banking.</p> <p>He started his career in auditing and consulting at Price Waterhouse and then switched over to banking, starting with Nigerian International Bank and City Bank.</p> <p>He &nbsp;rose to the apex of the profession as Managing Director/Chief Executive of NAL Bank Pk (2000-2005). and Executive Director – Sterling Bank Plc from January to August 2006.</p> <p>He worked with three other banks and ended up as the Managing Director/CEO of NAL Bank Plc from year 2000 to 2005. During the consolidation period, he joined Sterling Bank as Executive Director from the beginning of 2007 to August when he left for private consulting practice, and in January 2007, he was invited to join the Cabinet of the Lagos State Government.</p> <p>He has served as Lagos State Commissioner for Economic Planning &amp; Budget since in 2007 having first been appointed by Governor Tinubu and then re-appointed for two terms now by Governor Fashola.</p> <p><b>Pastor Ben</b>&nbsp;is very passionate about societal transformation and actively participates in programmes designed to bring the desired change in his country. In this respect, he serves on the Boards of the Apostles in the Marketplace, Society for National Transformation, Africa Missions Global, etc.</p> <p><span style=\"font-family: 'Open Sans', sans-serif;\">&nbsp;The President of Nigeria recently approved his appointment as&nbsp;</span>&nbsp;the Director-General, Budget Office. He&nbsp;is married to&nbsp;Ngozi&nbsp;and they are blessed with children.</p> <p class=\"p1\"><span style=\"text-align: justify;\"></span></p> </div>"
}, {
  "designation": "Worship Minister & Co Host LIWC",
  "img": "http://res.cloudinary.com/kaydence-co/image/upload/v1504705906/nat_fkpwoa.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Lagos, Nigeria",
  "name": "Nathaniel Bassey",
  "profile": "<div class=\"uncode_text_column\"><p class=\"p1\" style=\"text-align: justify;\"><span class=\"s1\">Nathaniel believes that music is primarily, a fundamental tool in the praise and worship of God and an avenue by which He (God) relates with His people. He expresses His deep love for God through his music. And features in concerts, crusades, churches and other kingdom events and continues to lead many into the presence of the LORD.Nathaniel Bassey is a gospel music minister from Akwa Ibom State but based in Lagos, Nigeria. He is a Recording Artiste, trumpet player, singer/song-writer and music producer who was inspired years ago at a concert by Dr. Panam Percy Paul at a concert. He also serves as Pastor of The Oasis – the Youth church of The Redeemed Christian church of God, The King’s court, Victoria – Island Lagos. Before accepting the call to full time music ministry, Nathaniel was band leader of the Steve Rhodes Jazz orchestra, a member of the Spectrum 4 jazz quintet, and many other musical bands and affiliations.</span></p> <p class=\"p1\" style=\"text-align: justify;\"><span class=\"s1\">He ministers around the world and is privileged to do so alongside internationally recognized worship leaders and musicians like Phil Driscoll, Terry Macalmon, William Mcdowell, Micah Stampley, Alvin Slaughter, Donnie Mcclurkin, Israel Houghton, Panam Percy Paul, Sinach, and many more.</span></p> <p class=\"p1\" style=\"text-align: justify;\"><span class=\"s1\">He is a regular feature at the “Worship His Majesty world tour” that spans The UK, Germany, Australia, Israel, USA and Africa.&nbsp; He is&nbsp; the co-convener of BORN TO WORSHIP, a yearly worship event where Jesus is lifted high through heartfelt praise and worship.</span></p> <p class=\"p1\" style=\"text-align: justify;\"><span class=\"s1\">Inspiring the next generation of worship leaders and gospel musicians has also been a major focus of his ministry. And has part of his passion, Nathaniel’s regular articles on social media and magazines have come to be widely read in the gospel music circle, emphasizing the concept of a “TOTAL AND COMPLETE” music minister with SPIRIT, SKILL AND CHARACTER. In addition, his trumpet and minstrel academy – TAMA, is another initiative to teach trumpet techniques, music theory and worship free of charge to young and aspiring trumpet players. Another initiative is the monthly mentoring program for worship leaders and gospel musicians where prayer, word, and teachings on the music ministry are the primary focus. He is also a speaker and guest clinician at worship and music seminars in and outside the country.</span></p> <p class=\"p1\" style=\"text-align: justify;\"><span class=\"s1\">He is a passionate writer whose songs are being sung and performed as covers around the world. And he believes his songs must be Jesus centered – Highlighting the love, grace, power, holiness and faithfulness of the almighty God.</span></p> <p class=\"p1\" style=\"text-align: justify;\"><span class=\"s1\">Nathaniel’s distinctly prophetic sound on the trumpet resonates far and wide, stirring a revival and passion to holiness, godliness and heartfelt worship in the body of Christ.</span></p> <p class=\"p4\" style=\"text-align: justify;\">His debut album, ELOHIM, was recorded and mixed in cape town South Africa. While his latest album, THE SON OF GOD, was recorded in Houston, Texas USA. It has been described, by international gospel Artistes like Micah Stampley, Tina and Erica Campbell of MaryMary as a worshippers’ collectors item. With Songs like casting crowns, Imela, No other God becoming church anthems around the globe, transcending racial, cultural and ethnic lines and boundaries.</p> <p class=\"p4\"><span class=\"s1\">He is married to Sarah Bassey and they have two lovely children, David and Victory</span></p> <p class=\"p2\"><span style=\"text-align: justify;\"></span></p> </div>"
}, {
  "designation": "Worship Leader",
  "img": "https://res.cloudinary.com/kaydence-co/image/upload/v1504711299/Brandon_Roberson_qdlczf.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "USA",
  "name": "Brandon Roberson",
  "profile": "<div class=\"uncode_text_column\"><p>Brandon Roberson is an international worship leader whose primary focus is the kingdom of God. His vision expands beyond praise and worship. He has been a worship leader for over a decade.</strong></p> <p>He is a loving minister of the gospel of Christ and he is very passionate of God’s words and ways, therefore the word of God never departs from his lips as he preaches and teaches it; helping people to know more of who God is by motivating and equipping them to be all that God called them to be. He specializes in biblically training worship team to function effectively and efficiently as one in Christ.</p> <p> In 2013, Brandon Roberson founded Face to Face Ministries International with the mission mandate of bringing people face to face with God’s love through the ministry of praise, worship, teaching and outreaching. Face to Face embodies what it means to experience Christ’s love not only by worship but also through local community outreach, supporting mission efforts and partnering with organizations that share a similar vision.</p> <p>He has ministered alongside Dr Creflo Dollar, Bishop T.D. Jakes, Kenneth Copeland, Andrew Wommack, Cece Winans , Israel Houghton, Mary Mary, among many others.</p> <p>His current projects include Face to Face and Brandon Live. He is featured as a worship leader of Overflow, a project produced by Israel Houghton. He is also currently a worship leader of Living Word Christian Center in Chicago, Illinois.</p> <p>He is married and blessed with two children.</p> <p style=\"text-align: justify;\"> </p></div>"
}, {
  "designation": "Worship Minister",
  "img": "http://res.cloudinary.com/kaydence-co/image/upload/v1504705906/yomi_fcn2dq.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Ibadan, Nigeria",
  "name": "Yomi Ajayi",
  "profile": "<div class=\"uncode_text_column\"><p class=\"p2\"><span class=\"s1\">The name Yomi Ajayi is indistinguishable with grace, attitude, strength and depth in worship all across churches and denominations within and outside Nigeria. An accomplished multi-gifted musician, creative songwriter, recording artist, and worship leader. He has become one of the defining voices of this generation as a cutting edge minstrel with the renowned Bishop Francis Wale Oke for well over 20 years.</span></p> <p class=\"p2\"><span class=\"s1\">Yomi is the founder of WordPraise International with the mandate- teaching and leading nations in worship contrary to traditions. He is currently, providing new songs for congregational worship and mentoring new songwriters and worship leaders, and upcoming music ministers. He is based in Ibadan, Nigeria with his precious family-Tayo, Paul, Sam and Zoe.</span></p> <p style=\"text-align: justify;\"> </p></div>"
}, {
  "designation": "Worship Minister",
  "img": "http://res.cloudinary.com/kaydence-co/image/upload/v1504713276/olumide-iyun-profile_zjhcjp.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Lagos, Nigeria",
  "name": "Olumide Iyun",
  "profile": "<div class=\"uncode_text_column\"><p class=\"p1\"><span class=\"s1\">Olumide Iyun is a songwriter, worshipper, keyboardist and producer. He is married to Itunuade and they have two children. They are based in Lagos in southwest Nigeria.</span></p> <p class=\"p1\"><span class=\"s1\">As a child growing up in the quiet city of Ibadan, Nigeria, Olumide displayed reasonable musical ability and that talent was honed through the years through school work, various choirs and music mentors. He became caught up in worship as a young believer while listening to music ministries such as Vineyard Music, Maranatha, and Hosanna Integrity, and he absolutely loved the experience of worship in his local assembly at the time, Christ Chapel Ibadan. As he sought the face of the Lord concerning the purpose of his life, Olumide felt the call of God to serve in worship and has stayed faithful to the call over the last 22 years.</span></p> <p class=\"p1\"><span class=\"s1\">He has served as Music Director at Christ Chapel International Churches, Port Harcourt, Christ Chapel International Churches, Ibadan, This Present House Lagos, and he currently serves in the leadership of Covenant Christian Centre, Lagos. He has released two albums, Behold The King (2011), and No One Like Our God, which was released in January 2015. His latest work, No One Like Our God, was recorded in Houston, Lagos, and CapeTown. It features a number of worship leaders in Nigeria and the USA such as Chingtok Ishaku, Nathaniel Bassey, Mayra Alvarez, Morayo Vessel, Victoria Orenze, and The Noize (the children’s choir of Grace Community Church, Houston). He is a founding member of Worshippers Collective, a team of worship leaders, ministers, and pastors across Nigeria.</span></p></div>"
}, {
  "designation": "Worship Minister",
  "img": "http://res.cloudinary.com/kaydence-co/image/upload/v1504713482/wale-adenuga2_vkdhj9.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Lagos, Nigeria",
  "name": "Wale Adenuga",
  "profile": "<div class=\"uncode_text_column\"><p class=\"p1\"><span class=\"s1\">Pastor Wale Adenuga is best known for songwriting and leading worship. His songs like Today O, You alone are worthy Lord, It is you, Lord because of me have become favourite praise and worship songs in many churches the world over. His group, Fountain of Praise which he heads has recorded several albums and that in concert with renowned worship leaders such as Lenny Leblanc, Bob Fitts and David Baroni.</span></p> <p class=\"p1\"><span class=\"s1\">Fountain of Praise also hosts Worship for Change concerts which has helped to raise over $70,000 for orphans and children with special needs in Nigeria. Currently, Wale pastors Jubilee Christian Centre, a parish of the Redeemed Christian Church of God.</span></p> <p class=\"p2\"><span style=\"text-align: justify;\"></span></p> </div>"
}, {
  "designation": "Worship Minister",
  "img": "http://www.liwc.co/img/david.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Lagos, Nigeria",
  "name": "David Nkennor",
  "profile": "<div><p>DAVID NKENNOR is a Worship Leader and Song-writer with clear grace and a peculiar anointing for what he does. His singing ministry began as a teenager in 1999, in a 6-man accapella group called BABY’S HEART. Baby’s Heart gained a fair degree of popularity within a decade, ministering humility and the love of Jesus across several University campuses, Concerts and Churches in Nigeria. </p>\r\n<p>Over the years following, David worked alongside numerous A-list Gospel artistes, was involved in organizing and planning several events, and also in the production of an independent Christian TV programme. David is a unique blend of creativity and experience with a strong passion for God in worship. </p>\r\n<p>He is the author of “Without Restriction”, \"Blessings &amp; Honour\", “We want more”, and several other songs used in many Churches today. An Educationist by training, David has featured both as an Artiste and/or Speaker at major Christian events and Music seminars across Nigeria. He is also known for planning and hosting great Worship concerts. </p><p>His live-recorded albums, “WORSHIP IS W.I.D.E 1 &amp; 2” recorded in 2008 and 2014 respectively, keep making impact in lives home and abroad. David Nkennor is the Visioneer, WORSHIP IS W.I.D.E.</p></div>"
}, {
  "designation": "Minister",
  "img": "https://res.cloudinary.com/kaydence-co/image/upload/v1504714659/rev-ig_yiblmt.jpg",
  "links": {
    "facebook": "https://facebook.com/",
    "instagram": "https://instagram.com",
    "twitter": "https://twitter.com/",
    "website": "http://rccgtkclagos.com"
  },
  "location": "Warri, Nigeria",
  "name": "Rev. Igho Yegbeburu",
  "profile": "<div class=\"uncode_text_column\"><p class=\"p1\"><span class=\"s1\">Rev. Igho Lewis Yegbeburu is a distinguished clergyman, songwriter,composer, arranger, music producer and life coach. He is the president of the Glorious Fountain Ministries an interdenominational nonprofit body committed&nbsp;to promoting worship and the unity of Churches through music since 1994. In the late 80’s, he committed his life to Jesus Christ after reading Billy Graham’s “DecisionMagazine”.</span></p> <p class=\"p1\"><span class=\"s1\">His traditional religious life was transformed to a vibrant intimate relationship with Jesus and a strong love for people. Inspired by the ministry of Benny Hinn with strong emphasis on the personality of the Holy Spirit, he began to receive inspiration to write new songs. As the collection of the songs increased it became obvious that these songs were meant to bless the World and it led to the formation of the music group –&nbsp;The Glorious Fountain Ministries.</span></p> <p class=\"p1\"><span class=\"s1\">Since then they have recorded nine gospel albums that are blessing lives all over the world. Presently, songs from these albums enjoy an increasing air playing time on Radio and TV stations (Terrestrial and Satellite) locally and internationally. They include: One Gospel, Dove TV, RTM, New Frontiers, Kingdom Africa, MBC Huston Texas USA and others. Rev. Igho and the Glorious Fountain Choir is one gospel musical group making a difference from Africa to the glory of God. Motivated by his passion to experience and promote worship he poured his heart into writing the book “Finding Fresh Passion to Worship”. Amazingly, Xulon Press in the United States of America rewarded this effort and passion with the award of the 2011 Christian Choice bookawards. This book is presently being used as a textbook in the teaching of worship in two reputable Baptist Theological Seminaries in Oyo state and Kaduna state both in Nigeria.&nbsp;This is in addition to several lives being blessed.</span></p> <p class=\"p3\"><span class=\"s1\">&nbsp;</span></p> <p class=\"p1\"><span class=\"s1\">This award and&nbsp;recognition further laid credence to his position that you don’t have to change your nationality or country to achieve success and fulfil destiny. He is in forefront among those encouraging young people to blossom where God planted them to fulfil destiny. This is the motivation behind the group “Youth Ablaze Network” which he started to create a platform to help seek, equip, develop and nurture the potentials of young people. In the process he has succeeded in creating an alternative to help discourage youth restiveness in the volatile oil rich Niger Delta region of Nigeria.</span></p> <p class=\"p1\"><span class=\"s1\">Motivated by a strong passion to help people fulfil the dream, Rev. Igho and his wife Toyin are the brain behind the charitable work “Replenish Charity Foundation ”(previously known as Shunnamite’s Charity Fund) This is a non-profitable body dedicated to breathe life to destinies through provision of partial or full scholarshipto help young and promising individuals fulfil their dream of having a college or University education. This Charity also help in supporting churches/Ministries and their leaders to continue the good work of service to humanity through the provision of monthly stipend or salaries, instruments/equipment and the renovation/provision of building facilities. The Charity work is involved in providing welfare packages to Orphans, Widows, and others in need. This Charity work is funded by The Glorious Fountain Ministries, Doxa Creative Concepts with the support of organizations like Ogaga/Hilary Foundation and other well-meaning individuals and organizations.</span></p> <p class=\"p3\"><span class=\"s1\">&nbsp;</span></p> <p class=\"p1\"><span class=\"s1\">Rev. Igho L. Yegbeburu is also a member board of director Doxa Creative Concepts Limited, an emerging first class service provider. One of the fast growing business group in Nigeria.</span></p> <p class=\"p3\"><span class=\"s1\">&nbsp;</span></p> <p class=\"p1\"><span class=\"s1\">He is married to Toyin Janet Yegbeburu and they are blessed with three lovely children David, Sharon and Bliss. They live and serve the purpose of God from the twin cities of Warri and Effurun Delta State Nigeria where they enjoy the support and the love of many.</span></p> <p class=\"p1\" style=\"text-align: justify;\"> </p></div>"
}]